import React from "react";
import { Card, Divider, Body1, Fab } from "ui-neumorphism";
import {FaFacebookSquare, FaTelegram} from 'react-icons/fa';

const About = () => {
  //   const countryState = useReducerAPI('https://simplemaps.com/static/data/country-cities/mm/mm.json')

  return (
    <>
      <Card
        style={{
          padding: "2.1875em 5%",
        }}>
        <h1>ABOUT US</h1>
        <Divider dense />
        <Body1>
          ကျွန်တော်တို့ Hlu Kya Ml (လှူကြမယ်) Page လေးရဲ့ ရည်ရွယ်ချက်ကတော့
          စစ်ဘေးရှောင် ဒေသတွေ နဲ့ တကယ်လိုအပ်တဲ့နေရာတွေကို
          ထောက်ပံ့ပေးချင်လို့ပါဗျ။ ဒီလိုပြောလို့ အိတ်ထဲက ပိုက်ဆံကိုထုတ်ပြီး
          လှူပေးရမှာ မဟုတ်ပါဘူး။ တချို့က လှူချင်ရဲ့သားနဲ့ အဆင်မပြေလို့
          မလှူနိုင်သူတွေရှိပါတယ်။ အဓိကက ဝင်ငွေမရှိလို့ပါ။
          ကျွန်တော်တို့အပါအဝင်ပေါ့ခင်များ။
        </Body1>
        <Body1>
          ဒါကြောင့် အားလုံးအဆင်ပြေပြီး မလှူနိုင်တဲ့လူမရှိရလေအောင်
          လူသားချင်းစာနာတဲ့ စိတ်ကလေးကို အခြေခံပြီး ဒီအစီစဉ်လေးကို
          လုပ်လိုက်ရတာပါ။ ဘယ်လိုလုပ်ရမယ်ဆိုတာ အခုသေချာရှင်းပြပေးပါမယ်။
          ကျွန်တော်တို့က စာအုပ် download link တချို့ကို ချပေးပါ့မယ်။ အဲ့ link
          ထဲကိုဝင်ပြီး download clip မနှိပ်ခင်မှာ စာအုပ်ကြော်ငြာဝင်ပါမယ်။
          ကြော်ငြာကို skip နှိပ်ပြီးတာနဲ့ ဖတ်ချင်တဲ့စာအုပ်ကိုစတင် down
          လို့ရပါပြီ။ အလှူငွေကိုတော့ အဲဒီ Ads (ကြော်ငြာ) ကနေ ရရှိမှာဖြစ်ပါတယ်။
          နည်းနည်းများရှုပ်သွားကြသလားမသိဘူး။ ကျွန်တော်ဆက်ရှင်းပြပါ့မယ်။
        </Body1>
        <Body1>
          ယခင်က Channel Myanmar ကနေ download ဆွဲဖူးသူတွေ‌ဆိုသိပါတယ်။ Movie
          download link ထဲရောက်ဖို့ကို Adfly က ကြော်ငြာတွေကို
          အဆင့်ဆင့်ဖြတ်ပြီးမှ download လုပ်လို့ရတာမျိုးပါ။
          ကြော်ငြာကြည့်ရှု့နှုန်းများလေ အလှူငွေရလေပါပဲ။ Cost Per Mille (Cost Per
          Thousand) ကြည့်ရှု့သူ အယောက် ၁၀၀၀ အတွက် ရရှိငွေ 3 USD သဘောမျိုးပါ။
          အတိုချုံး ပြောရရင် ကြော်ငြာကြည့်တဲ့သူအပေါ်မူတည်ပြီး အလှူ‌ငွေရရှိမှာပါ။
          ငွေကိုတော့ PayPal or Payoneer တို့နဲ့ ထုတ်ရပါတယ်။ (၅ရက်ရနေ
          ၇ရက်အတွင်းတော့ စောင့်ရလေ့ရှိပါတယ်) အဓိကက စာဖတ်ဝါသနာပါတဲ့သူတွေအတွက်
          ရည်ရွယ်ပါတယ်။ စာဖတ်ဝါသနာမပါလည်း Link ကို Clip လုပ်ပြီး
          ကြော်ငြာခဏစောင့်ပြီး ပေါ်လာတာနဲ့ Skip နှိပ်ပြီး ပြန်ထွက်ရင်
          အဆင်ပြေပါတယ်။ ခုလောလောဆယ်တော့ ကျွန်တော်တို့က English EBook တွေကို
          ဦးစားပေးတင်ပေးသွားမှာပါ။ နောက်ပိုင်းတော့ မြန်မာစာအုပ်တချို့ကိုပါ
          Review ရေး‌ပေးပြီး download လုပ်လို့ရအောင်စဉ်းစားထားပါတယ်။ Website
          လည်းရှိတဲ့အတွက် လိုချင်တဲ့စာအုပ်တွေကို တစုတစည်းတည်းလည်း
          ဝင်ရှာလို့ရပါတယ်။
        </Body1>
        <Body1>
          ကဲ ... အားလုံး အဆင်မပြေဘူးလားဗျာ။ အိမ်ထဲကနေပြီး တိုက်ပွဲဝင်နေသူတွေကို
          ကျွန်တော်နဲ့ အတူ တစ်တပ်တစ်အား ကူညီအားဖြည့်လိုက်ရအောင်လား။
          အရေးတော်ပုံအတွက် တစ်ထောင့်တစ်နေရာက ပါဝင်အားဖြည့်တာလည်း မွန်မြတ်တဲ့
          အလုပ်တစ်ခုပါပဲ။ ကောက်ခံရရှိသမျှအလှူငွေတွေကိုလည်း
          ကျွန်တော်တို့ကိုယ်ကျိုးအတွက် လုံးဝ လုံးဝ အသုံးမပြုပါဘူးခင်များ။
          ကောက်ခံရရှိသမျှငွေကိုလည်း အလှူစာရင်းနှင့်တကွ တင်ပြပေးသွားမှာပါ။
          နေ့တိုင်းဖတ်မယ် နေ့တိုင်းလှူမယ်။ များများဖတ်မယ် များများလှူမယ်။
        </Body1>
        <div className="row">
          <div className="col-md-3"/>
          <Fab className="col-sm-12 col-md-3 my-4 d-inline-flex justify-content-center" onClick={function () {
                window.open(`https://www.facebook.com/hlukyaml/`);
              }}>
          &nbsp;
          <FaFacebookSquare/>
          &nbsp;Facbook&nbsp;
        </Fab>
        <Fab className="col-sm-12 col-md-3 my-4 d-inline-flex justify-content-center" onClick={function () {
                window.open(`https://t.me/hlukyaml`);
              }}>
          &nbsp;
          <FaTelegram/>
          &nbsp;Telegram&nbsp;
        </Fab>
        <div className="col-md-3"/>
          </div>
      </Card>
    </>
  );
};

export default About;
